'use strict';

const articles = [
  {
    "duration": "19 минут чтения",
    "thumbnail": "За последние два десятилетия в процессе создания ПО произошли значительные изменения. Многие из традиционных управленческих и технических приемов были заменены новыми подходами, которые сочетают в себе опыт успешных проектов и преимущества технологии разработки ПО. Этот переход мотивировался неутолимой жаждой создания ПО с меньшими затратами, большим числом возможностей и за более",
    "title": "Принципы и методы коллективной разработки программных продуктов"
  },
  {
    "duration": "20 минут чтения",
    "thumbnail": "Непредсказуемость — первопричина того, что в последние 30 лет называли «кризисом ПО».",
    "title": "Организация коллективной работы программистов"
  },
  {
    "duration": "23 минут чтения",
    "thumbnail": "Многие организации-разработчики ПО сосредоточивают свое внимание на совершенст-вовании процесса для повышения степени предсказуемости управления проектом и положения дел в тех направлениях бизнеса, которыми они занимаются (это имеет отношение к качеству продукта, времени выхода на рынок, отдаче от инвестиций и производительности). Для того чтобы современные проекты по созданию ПО могли приносить",
    "title": "Типы организации бригад. Бригада главного программиста"
  },
  {
    "duration": "11 минут чтения",
    "thumbnail": "Профессионалы в области ПО в обоих типах организаций мотивируются карьерным ростом, удовлетворением от работы и возможностью выбора.",
    "title": "Обязанности членов бригады. Распределение обязанностей в бригаде"
  },
  {
    "duration": "16 минут чтения",
    "thumbnail": "Термин «процесс» слишком перегружен. В организациях, ориентированных на создание ПО, существует много процессов разного масштаба. Я буду использовать слово «процесс» в трех различных значениях.",
    "title": "Совершенствование процесса создания ПО"
  },
  {
    "duration": "5 минут чтения",
    "thumbnail": "В процессе разработки программных средств в той или иной мере используется компьютерная поддержка процессов разработки ПС.",
    "title": "Инструментальные средства разработки. История языков программирования"
  },
  {
    "duration": "13 минут чтения",
    "thumbnail": "Наверное, нет такого программиста, который не хотел бы создать свой собственный язык программирования: самый быстрый и надежный, самый удобный и простой. Именно поэтому за всю свою «компьютерную» историю человек придумал множество самых разных языков программирования. Одни из них послужив своим создателям, канули в «лету», другие, получив признание программистов всего мира,",
    "title": "Общая характеристика инструментальных средств разработки программ, состояние и перспективы"
  },
  {
    "duration": "8 минут чтения",
    "thumbnail": "В настоящее время с каждой системой программирования связываются не отдельные инструменты (например, компилятор), а некоторая логически связанная совокупность программных и аппаратных инструментов поддерживающих разработку и сопровождение ПС на данном языке программирования или ориентированных на какую-либо конкретную предметную область. Такую совокупность будем называть инструментальной средой разработки и сопровождения ПС.",
    "title": "Состав и применение инструментальных средств разработки программного обеспечения"
  }
];
