'use strict';

const articles = [
  {
    "duration": "19 минут чтения",
    "thumbnail": "За последние два десятилетия в процессе...",
    "title": "Принципы и методы коллективной разработки программных продуктов"
  },
  {
    "duration": "20 минут чтения",
    "thumbnail": "Непредсказуемость — первопричина того, что в...",
    "title": "Организация коллективной работы программистов"
  },
  {
    "duration": "23 минут чтения",
    "thumbnail": "Многие организации-разработчики ПО сосредоточивают свое внимание...",
    "title": "Типы организации бригад. Бригада главного программиста"
  },
  {
    "duration": "11 минут чтения",
    "thumbnail": "Профессионалы в области ПО в обоих...",
    "title": "Обязанности членов бригады. Распределение обязанностей в бригаде"
  },
  {
    "duration": "16 минут чтения",
    "thumbnail": "Термин «процесс» слишком перегружен. В организациях,...",
    "title": "Совершенствование процесса создания ПО"
  },
  {
    "duration": "5 минут чтения",
    "thumbnail": "В процессе разработки программных средств в...",
    "title": "Инструментальные средства разработки. История языков программирования"
  },
  {
    "duration": "13 минут чтения",
    "thumbnail": "Наверное, нет такого программиста, который не...",
    "title": "Общая характеристика инструментальных средств разработки программ, состояние и перспективы"
  },
  {
    "duration": "8 минут чтения",
    "thumbnail": "В настоящее время с каждой системой...",
    "title": "Состав и применение инструментальных средств разработки программного обеспечения"
  }
];
